Repository: clairvy/perl6-doc-ja
Catalog: perl6-doc-ja-level2.tmx
Source language: en_us
Languages: ja

source: Within a signature or other declaration, the :: sigil followed by an identifier marks a type variable that also declares the visibility of a package/type name without the sigil within the scope of the declaration.
ja: シグネチャか他の宣言内で、識別子が続く:: sigilはpackage/type名の可視性をスコープ宣言のsigil無しに宣言する型変数をマークします。

source: The first such declaration within a scope is assumed to be an unbound type, and takes the actual type of its associated argument.
ja: 最初はそのようなスコープ付きの宣言はバインドされない型とみなされ、その関連付けられた引数の実際の型を受け取ります。

source: With subsequent declarations in the same scope the use of the sigil is optional, since the bare type name is also declared.
ja: 後に続く同じスコープの宣言内のsigilは任意なので、裸の型名も宣言されます。

source: A declaration nested within must not use the sigil if it wishes to refer to the same type, since the inner declaration would rebind the type.
ja: 内側をネストする宣言は同じ型を参照したい場合はsigilを使うことは出来ません。内側の宣言は型を再バインドするからです。

source: (Note that the signature of a pointy block counts as part of the inner block, not the outer block.)
ja: (pointy blockのシグネチャは外側のブロックではなく内側のブロックとして数えられルので注意して下さい。)

source: Sigils indicate overall interface, not the exact type of the bound object.
ja: Sigilsはバインドされたオブジェクトの正確な型ではなく、全体的なインターフェースを示します。

source: Different sigils imply different minimal abilities.
ja: 異なるsigilsはわずかな異なる能力を意味します。

source: $x may be bound to any object, including any object that can be bound to any other sigil.
ja: $x は，どんなオブジェクトにでも束縛されることが許されています。それにはそれ以外の sigil に束縛されたものをも含みます。

source: Such a scalar variable is always treated as a singular item in any kind of list context, regardless of whether the object is essentially composite or unitary.
ja: そのようなスカラー変数はオブジェクトが本質的に複合型か単一型かどうかに関わらず常にどのようなリストコンテキストでも単数形アイテムとして扱われます。

source: It will not automatically dereference to its contents unless placed explicitly in some kind of dereferencing context.
ja: 何らかの種類のデリファレンスコンテキストに置かれなければ、その内容は自動的にデリファレンスされないでしょう。

source: In particular, when interpolating into list context, $x never expands its object to anything other than the object itself as a single item, even if the object is a container object containing multiple items.
ja: 特に、リストコンテキストに差し込まれている場合、$x は単一のアイテムとしてオブジェクト自身以外の何か他のものとしてそのオブジェクトを展開しません。

source: @x may be bound to an object of the Array class, but it may also be bound to any object that does the Positional role, such as a List, Seq, Range, Buf, or Capture.
ja: @xは、単体のArray クラスのオブジェクトに束縛されることが許されていますし、List、Seq、Range、Buf、CaptureのようなPositional role を負う全てのオブジェクトに束縛されることも許されています。

source: The Positional role implies the ability to support postcircumfix:<[ ]>.
ja: Positional role は、postcircumfix:<[ ]>をサポートする能力のことを意味します。

source: Likewise, %x may be bound to any object that does the Associative role, such as Pair, Mapping, Set, Bag, KeyHash, or Capture.
ja: 同様に%x は，Pair、Mapping、Set、Bag、KeyHash、CaptureのようなAssociative role を負う全てのオブジェクトに束縛されることが許されています．

source: The Associative role implies the ability to support postcircumfix:<{ }>.
ja: Associative role は、postcircumfix:<{ }>をサポートする能力のことを意味します。

source: &x may be bound to any object that does the Callable role, such as any Block or Routine.
ja: &xは、Block、RoutineのようなCallable role を負う全てのオブジェクトに束縛されることを許されています。

source: The Callable role implies the ability to support postcircumfix:<( )>.
ja: Callable role は、postcircumfix:<( )>をサポートする能力のことを意味します。

source: ::x may be bound to any object that does the Abstraction role, such as a package, module, class, role, grammar, or any other type object, or any immutable value object that can be used as a type.
ja: ::x は、package、module、class、role、grammar、それ以外の全ての型オブジェクトや型として使われるimmutable な値オブジェクトのようなAbstraction role を負う全てのオブジェクトに束縛されることを許されています。

source: This Abstraction role implies the ability to do various symbol table and/or typological manipulations which may or may not be supported by any given abstraction.
ja: Abstraction role は、抽象化によりサポートすることを許可されたり，そうでないような様々なシンボルテーブルや型論理を操作する能力を意味します．

source: Mostly though it just means that you want to give some abstraction an official name that you can then use later in the compilation without any sigil.
ja: それはコンパイル中になんらかのsigil無しに抽象化に後で使えるように公式な名前を与えるだけです。

source: In any case, the minimal container role implied by the sigil is checked at binding time at the latest, and may fail earlier (such as at compile time) if a semantic error can be detected sooner.
ja: どのような場合でも、sigilによって意味づけされた最小のコンテナroleは最新のバインディング時にチェックされ、文法エラーがすぐに検出できるなら（コンパイル時のような）早期に失敗します。

source: If you wish to bind an object that doesn't yet do the appropriate role, you must either stick with the generic $ sigil, or mix in the appropriate role before binding to a more specific sigil.
ja: 適切なroleを負わないオブジェクトを束縛したい場合、一般的な$ sigilにこだわるか、より特定されたsigilと束縛する前に適切なroleをミックスインしてやらなければなりません。

source: An object is allowed to support both Positional and Associative.
ja: PositionalとAssociativeをサポートするオブジェクトも許されています。

source: An object that does not support Positional may not be bound directly to @x.
ja: Positionalをサポートしないオブジェクトを@xに直接束縛することは許されていません。

source: However, any construct such as %x that can interpolate the contents of such an object into list context can automatically construct a list value that may then be bound to an array variable.
ja: ただし、リストコンテキスト内でのオブジェクトの内容を挿入するような%xの構築は、1つの配列変数に束縛されているリスト値を自動的に構築する。

source: Subscripting such a list does not imply subscripting back into the original object.
ja: そのようなリストの添字は元のオブジェクトの添字を意味しません。

source: Unlike in Perl 5, you may no longer put whitespace between a sigil and its following name or construct.
ja: Perl 5と違い、もはやsigilとそれに続く名前または構造の間に空白を置けないでしょう。

source: Ordinary sigils indicate normally scoped variables, either lexical or package scoped.
ja: 普通のsigilsは通常のスコープ変数、レキシカルかパッケージスコープを示します。

source: Oddly scoped variables include a secondary sigil (a twigil) that indicates what kind of strange scoping the variable is subject to:
ja: 変なスコープ変数は変数がどの種類の奇妙なスコープに従属するかを示す2つ目のsigil(twigil)を含みます:

source: Most variables with twigils are implicitly declared or assumed to be declared in some other scope, and don't need a "my" or "our".
ja: ほとんどのtwigils変数は暗黙に他のスコープに宣言されるか宣言されていると見なされ、"my"か"our"を必要としません。

source: Attribute variables are declared with has, though.
ja: 属性変数はhasで宣言されます。

source: Sigils are now invariant.
ja: Sigilsは今は変わりません。

source: $ always means a scalar variable, @ an array variable, and % a hash variable, even when subscripting.
ja: $は常にスカラー変数を意味し、添字がある場合でも@は配列、%はハッシュ変数です。

source: In item context, variables such as @array and %hash simply return themselves as Array and Hash objects.
ja: アイテムコンテキストでは@arrayや%hashのような変数は単純にそれら自身をArrayやHashオブジェクトとして返します。

source: (Item context was formerly known as scalar context, but we now reserve the "scalar" notion for talking about variables rather than contexts, much as arrays are disassociated from list context.)
ja: (アイテムコンテキストは以前はスカラーコンテキストとして知られていましたが、われわれは"scalar"の概念をコンテキスト（リストコンテキストからの配列の解除）よりも変数のことに関しての話と予約しています。

source: In string contexts, container objects automatically stringify to appropriate (white-space separated) string values.
ja: 文字列コンテキストではコンテナオブジェクトは自動的に適切な文字列値に文字列化(空白で区切られた)されます。

source: In numeric contexts, the number of elements in the container is returned.
ja: 数値コンテキストではコンテナの要素数が返されます。

source: In boolean contexts, a true value is returned if and only if there are any elements in the container.
ja: ブールコンテキストでは、コンテナに要素がある場合だけtrue値が返されます。

source: To get a Perlish representation of any object, use the .perl method.
ja: オブジェクトのPerlっぽい表現を得るには.perlメソッドを使って下さい。

source: Like the Data::Dumper module in Perl 5, the .perl method will put quotes around strings, square brackets around list values, curlies around hash values, constructors around objects, etc., so that Perl can evaluate the result back to the same object.
ja: Perl 5のData::Dumperモジュールのように、.perlメソッドは文字列にクォートを置き、リスト値に角括弧を置き、ハッシュ値にカーリーを置きます。なのでPerlは結果を評価して同じオブジェクトに戻せます。

source: The .perl method will return a representation of the object on the assumption that, if the code is reparsed at some point, it will be used to regenerate the object as a scalar in item context.
ja: .perlメソッドはオブジェクトの想定の表現を返し、もしコードが同じ点で再解析されたら、アイテムコンテキストでオブジェクトをスカラーとして再出力するのに使われるでしょう。

source: If you wish to interpolate the regenerated object in a list context, it may be necessary to use <prefix:<| >> to force interpolation.
ja: もし再解析されたオブジェクトをリストコンテキストに挿入したいなら、<prefix:<| >>を強制挿入のために使う必要があるでしょう。

source: To get a formatted representation of any scalar value, use the .fmt('%03d') method to do an implicit sprintf on the value.
ja: スカラー値のフォーマットされた表現を得るには、値に暗黙のsprintfを行う.fmt('%03d')メソッドを使って下さい。

source: To format an array value separated by commas, supply a second argument: .fmt('%03d', ', ').
ja: 配列の値をコンマで区切ってフォーマットするには.fmt('%03d', ', ')のように第二引数を指定してください。

source: To format a hash value or list of pairs, include formats for both key and value in the first string: .fmt('%s: %s', "\n").
ja: ハッシュ値やペアのリストをフォーマットするには.fmt('%s: %s', "\n")のように最初の文字列にキィとバリューの両方に対してのフォーマットを含めてください。

source: Subscripts now consistently dereference the container produced by whatever was to their left.
ja: 添字は一貫して左にあるどんなものにでも作られたコンテナをデリファレンスします。

source: Whitespace is not allowed between a variable name and its subscript.
ja: 変数名と添字の間の空白は許されません。

source: However, there are two ways to stretch the construct out visually.
ja: しかし、構造を視覚的に引き延ばす2つの方法があります。

source: Since a subscript is a kind of postfix operator, there is a corresponding dot form of each subscript (@foo.[1] and %bar.{'a'}) that makes the dereference a little more explicit.
ja: 添字は後置演算子の一種なので、それぞれの添字に対応するdot形式があります(@foo.[1]と%bar.{'a'})。それはデリファレンスをより少し明示的にします。

source: Constant string subscripts may be placed in angles, so %bar.{'a'} may also be written as %bar<a> or %bar.<a>.
ja: 添字が定数文字列の場合は、山括弧内に置くこともできます。つまり%bar.{'a'}は%bar<a>か%bar.<a>とも書けます。

source: Additionally, you may insert extra whitespace using the unspace.
ja: 加えて、unspaceを使って追加の空白を挿入できます。

source: Slicing is specified by the nature of the subscript, not by the sigil.
ja: スライシングは添字の性質で指定され、sigilによってではありません。

source: The context in which a subscript is evaluated is no longer controlled by the sigil either.
ja: 添字が評価されているコンテキストは、もはやsigilによって制御されません。

source: Subscripts are always evaluated in list context.
ja: 添字は常にリストコンテキストで評価されます。

source: (More specifically, they are evaluated in a variant of list context known as slice context, which preserves dimensional information so that you can do multi-dimensional slices using semicolons.
ja: (より正確には、それらはsliceコンテキストというリストコンテキストの変化形で評価され、それは次元的情報を保存し、あなたはmulti-dimensionalスライスをセミコロンを使って行えます。

source: However, each slice dimension evaluates its sublist in normal list context, so functions called as part of a subscript don't see a slice context.
ja: しかし、それぞれの次元のスライスは普通のリストコンテキストなので添字の一部で呼ばれた関数はsliceコンテキストを認識しません。

source: If you need to force inner context to item (scalar), we now have convenient single-character context specifiers such as + for numbers and ~ for strings:
ja: もし内部のコンテキストをアイテム(スカラー)コンテキストに強制したいなら+を数値コンテキスト、~を文字列コンテキストに指定するなどの便利な単一文字のspecifiersがあります。

source: Sigils used either as functions or as list prefix operators also force context, so these also work:
ja: Sigilsを関数として、またはリストの前置演算子として使うかどちらかによってもコンテキストを強制できます。なのでこれらはこのようにも動きます:

source: But note that these don't do the same thing:
ja: しかしこれらは同じではないので注意して下さい:

source: There is a need to distinguish list assignment from list binding.
ja: リストバインディングからリストの割り当てを識別する必要があります。

source: List assignment works much like it does in Perl 5, copying the values.
ja: リストの割り当てはPerl 5のように、値をコピーして動きます。

source: There's a new := binding operator that lets you bind names to Array and Hash objects without copying, in the same way as subroutine arguments are bound to formal parameters.
ja: 新しい:=バインディング演算子があり、それはコピー無しにArrayとHashオブジェクトを名前にバインディングし、サブルーチンの引数の同じ方法ではパラメータに正式にバインドされます。

source: See S06 for more about binding.
ja: バインディングについて詳しくはS06を参照して下さい。

source: An argument list may be captured into an object with backslashed parens:
ja: 引数リストはバックスラッシュ括弧でオブジェクトに取り込まれます。

source: Values in a Capture object are parsed as ordinary expressions, then marked as positional or named.
ja: Captureオブジェクト内の値は普通の式としてパースされ、順番か名前でマークされます。

source: How these are resolved depends on what they are eventually bound to.
ja: どのように解決されるかは最終的に何にバインドされるかに依存します。

source: Some bindings are sensitive to multiple dimensions while others are not.
ja: 他がそうでない場合に、いくつかのバインディングは複数の次元に敏感です。

source: When cast into an array, you can access all the positional arguments; into a hash, all named arguments.
ja: 配列にキャストすると全てのポジショナル引数にアクセスできます。ハッシュなら全ての名前付き引数です。

source: All prefix sigil operators accept one positional argument, evaluated in item context as a rvalue.
ja: 全ての前置sigil演算子は一つのポジショナル引数を許容します。それは右辺値としてアイテムコンテキストで評価されます。

source: They can interpolate in strings if called with parentheses.
ja: それらはもし括弧で呼ばれたら文字列に差し込むことができます。

source: You can think of them as "fat" references, that is, references that can capture not only the current identity of a single object, but also the relative identities of several related objects.
ja: それらは"fat"リファレンスと考えることができます。それは現在のシングルオブジェクトのアイデンティティだけでなく、関連するいくつかのオブジェクトを取り込みます。

source: A signature object (Signature) may be created with colon-prefixed parens:
ja: シグネチャオブジェクト(Signature)はコロン前置の括弧で作成されます:

source: Expressions inside the signature are parsed as parameter declarations rather than ordinary expressions.
ja: シグネチャ中の式は普通の式ではなくパラメータ宣言として解析されます。

source: See S06 for more details on the syntax for parameters.
ja: パラメータの文法の詳細についてはS06を参照して下さい。

source: Signature objects bound to type variables (as in the example above) may be used within other signatures to apply additional type constraints.
ja: 型変数にバインドされたシグネチャオブジェクト(上記の例のように)は追加の型制約を適用するために他のシグネチャと共に使用されます。

source: Unlike in Perl 5, the notation &foo merely stands for the foo function as a Routine object without calling it.
ja: Perl 5と異なり、&fooという表記は単に関数fooをRoutineオブジェクトとして呼び出さないで取得します。

source: You may call any Code object by dereferencing it with parens (which may, of course, contain arguments):
ja: 括弧でデリファレンスしてCodeオブジェクトを呼べるでしょう(もちろん引数を含めて):

source: Whitespace is not allowed before the parens because it is parsed as a postfix.
ja: 括弧の前に空白は許されません。なぜなら括弧は後置として解析されるからです。

source: As with any postfix, there is also a corresponding .() operator, and you may use the "unspace" form to insert optional whitespace and comments between the backslash and either of the postfix forms:
ja: どのpostfixとも同じように、対応する.()演算子があり、オプショナルな空白やコメントを挿入するために間にバックスラッシュで"unspace"を使えます:

source: Note however that the parentheses around arguments in the "normal" named forms of function and method calls are not postfix operators, so do not allow the .() form, because the dot is indicative of an actual dereferencing operation, which the named forms aren't doing.
ja: 普通の形式の名前に付けられた括弧は関数かメソッド呼び出しですが後置演算子ではありません。そのため.()形式は許されません。なぜならドットは実際にはデリファレンス演算子を示すからです。

source: If you do use the dotty form on these special forms, it will assume you wanted to call the named form without arguments, and then dereference the result of that.
ja: これらの特別な場合にドット形式を使う場合は、引数無しに名前付き形式を呼ぶか、結果をデリファレンスしたいということを示します。

source: With multiple dispatch, &foo may actually be the name of a set of candidate functions (which you can use as if it were an ordinary function).
ja: マルチディスパッチにおいては&fooは実際には候補関数のセットの名前になります(それは普通の関数であるかのように使うことが出来ます)。

source: However, in that case &foo by itself is not sufficient to uniquely name a specific function.
ja: しかしこの場合は&foo自身は特定の関数の関数名となるには不十分です。

source: To do that, the type may be refined by using a signature literal as a postfix operator:
ja: 特定するために、型は後置演算子のシグネチャリテラルを使ってリファインされるでしょう:

source: It still just returns the Routine object.
ja: これはまだRoutineオブジェクトを返します。

source: A call may also be partially applied by using the .assuming method:
ja: 呼び出しは.assumingを使うことによっても部分的に適用されます:

source: Slicing syntax is covered in S09.
ja: スライシング文法はS09でカバーされます。

source: A multidimensional slice will be done with semicolons between individual slice sublists.
ja: 多次元スライスは個々のスライスサブリストの間のセミコロンで行います。

source: Each such slice sublist is evaluated lazily.
ja: それぞれのスライスサブリストは曖昧に評価されます。

source: To make a slice subscript return something other than values, append an appropriate adverb to the subscript.
ja: スライスの添字を値以外の何かを返すようにさせるには、添字に適切な副詞を加えます。

source: These adverbial forms all weed out non-existing entries.
ja: これらの副詞的形式は存在しないエントリーを取り去ります。

source: You may also perform an existence test, which will return true if all the elements of the slice exist:
ja: 全てのスライスの要素が存在するならtrueを返すテストを実行することもできます:

source: likewise,
ja: 同様に、

source: deletes the entries "en passant" while returning them.
ja: は値を返すついでに削除します。

source: (Of course, any of these forms also work in the degenerate case of a slice containing a single index.) Note that these forms work by virtue of the fact that the subscript is the topmost previous operator.
ja: (もちろん単一のインデックスのスライスでもこれらの形式は動きます。)添字が最も前の演算子であるという事実のおかげでこれらが動くということに注意して下さい。

source: (The situation does not often arise for the slice modifiers above because they are usually used in list context, which operates at comma precedence.)
ja: (このようなスライス修飾子はめったには起こりません。なぜならそれらは普通はコンマの優先順位を操作するリストコンテキストで使用されるからです。

source: In numeric context (i.e. when cast into Int or Num), a Hash object becomes the number of pairs contained in the hash.
ja: 数値コンテキスト(IntかNumにキャストされる場合)、Hashオブジェクトはハッシュに含まれるペアの数になります。

source: In a boolean context, a Hash object is true if there are any pairs in the hash.
ja: ブール値コンテキストではなんらかのペアがハッシュにあればtrueになります。

source: In either case, any intrinsic iterator would be reset.
ja: どちらかの場合で、内在のイテレータはリセットされるでしょう。

source: Sorting a list of pairs should sort on their keys by default, then on their values.
ja: ペアのリストをソートするとデフォルトでキーでソートされます。

source: Sorting a list of lists should sort on the first elements, then the second elements, etc.
ja: リストのリストをソートすると最初の要素でソートし、次に2番目の要素で、となります。

source: For more on sort see S29.
ja: sortの詳細についてはS29を参照して下さい。

source: Many of the special variables of Perl 5 are going away.
ja: Perl 5の特殊変数はなくなりました。

source: Any remaining special variables will be lexically scoped.
ja: 残りの特殊変数はレキシカルスコープです。

source: This includes $_ and @_, as well as the new $/, which is the return value of the last regex match.
ja: これは$_と@_を含み、同様に新しい$/は最後の正規表現マッチの返値です。

source: $0, $1, $2, etc., are aliases into the $/ object.
ja: $0、$1、$2などは$/オブジェクトの別名です。

source: The $#foo notation is dead.
ja: $#foo表記法はなくなりました。

source: Use @foo.end or @foo[*-1] instead.
ja: @foo.endか@foo[*-1]を使って下さい。

source: (Or @foo.shape[$dimension] for multidimensional arrays.)
ja: (または@foo.shape[$dimension]を多次元配列に使って下さい。)

source: An identifier is composed of an alphabetic character followed by any sequence of alphanumeric characters.
ja: 識別子は英数字が続くアルファベットで構成されます。

source: The definitions of alphabetic and numeric include appropriate Unicode characters.
ja: アルファベットと数字の定義は適切なユニコード文字を含みます。

source: Underscore is always considered alphabetic.
ja: アンダースコアは常にアルファベットと見なされます。

source: An identifier may also contain isolated apostrophes or hyphens provided the next character is alphabetic.
ja: 識別子は次の文字がアルファベットの孤立したアポストロフィかハイフンを含むかもしれません。

source: A name is anything that is a legal part of a variable name (not counting the sigil).
ja: 名前は変数名の適正な部分のことです(sigilは数えません)。

source: This includes
ja: これは以下を含みます。

source: When not used as a sigil, the semantic function of :: within a name is to force the preceding portion of the name to be considered a package through which the subsequent portion of the name is to be located.
ja: sigilとして使わない場合、名前の範囲での::の意味関数は後の位置の名前を伴っていれば、前の位置にパッケージとみなされる名前を強制します．

source: Unlike in Perl 5, if a sigil is followed by comma, semicolon, a colon not followed by an identifier, or any kind of bracket or whitespace (including Unicode brackets and whitespace), it will be taken to be a sigil without a name rather than a punctuational variable.
ja: Perl5と違って、sigilにコンマ、セミコロン、識別子が後に続かないコロン、括弧、空白(これにはUnicodeの括弧、空白を含む)が続く場合、お決まりの変数ではなく名前無しのsigilとみなされます．

source: This allows you to use sigils as coercion operators:
ja: これはsigilをcoercion演算子として使えるということです

source: In declarative contexts bare sigils may be used as placeholders for anonymous variables:
ja: 宣言コンテキストでは、裸のsigilは無名変数のプレイスホルダとして使われます。

source: Outside of declarative contexts you may use * for a placeholder:
ja: 宣言コンテキストの外側では、プレイスホルダとして*を使うことができます。

source: Attempts to say something like:
ja: 似たようなことを言おうとして

source: will result in the message, "Anonymous variable requires declarator".
ja: とすると"Anonymous variable requires declarator"というメッセージを受け取るでしょう。

source: Other all-caps names are semi-reserved.
ja: それ以外の全てが大文字の名前は準予約になっています。

source: When "strict" is in effect (which is the default except for one-liners), non-qualified variables (such as $x and @y) are only looked up from lexical scopes, but never from package scopes.
ja: "strict"が有効な場合(これはワンライナー以外ではデフォルトの動作です)では、資格を持たない変数($xや@yのような)は、レキシカルスコープからのみ見付けられますが，パッケージスコープからは見付けられません．

source: To bind package variables into a lexical scope, simply say our ($x, @y).
ja: レキシカルスコープへパッケージスコープの変数を束縛するには、単にour ($x, @y)を使います。

source: To bind global variables into a lexical scope, predeclare them with use:
ja: グローバル変数をレキシカルスコープに束縛するには、useでそれらをあらかじめ宣言する

source: Or just refer to them as $*IN and $*OUT.
ja: か，$*INや$*OUTのように参照します。

source: Every block is a closure.
ja: 全てのブロックはクロージャです。

source: This synopsis summarizes Apocalypse 10, which discusses packages despite never having been written.
ja: この概要は、Apocalypse 10 をまとめたもので、これ以前に書かれなかったパッケージについて話しています。

source: As in Perl 5, packages are the basis of modules and classes.
ja: Perl 5のように、パッケージは、モジュールとクラスの基礎となるものです。

source: Unlike in Perl 5, modules and classes are declared with distinct keywords, but they're still just packages with extra behaviors.
ja: Perl5とは異なり、モジュールとクラスは別々のキーワードで宣言されますが、それらは追加の機能を持ったパッケージでもあります。

source: Likewise every typename has an associated package namespace, even if unused.
ja: 同様に全ての型名は、パッケージを使うかどうかに関係なく、関係を持つパッケージの名前空間を持ちます。

source: An ordinary package is declared with the package keyword.
ja: 通常のパッケージは、packageキーワードで宣言されます。

source: Unlike in Perl 5, in Perl 6 it can only be used with a block:
ja: Perl5と違い、Perl6 ではブロックを伴ってのみ使用されることが許されます。

source: A named package declaration can occur as part of an expression, just like named subroutine declarations.
ja: 名前付きのパッケージ宣言は、表現の一部として現われ、ただの名前付きサブルーチン宣言のようでもあります。

source: As a special exception, if a braceless package declaration occurs as the first executable statement in a file, then it's taken to mean that the rest of the file is Perl 5 code.
ja: 特別な表現として、括弧を伴わないpackage宣言がファイルの実行可能な最初の文として現れた場合、ファイルの残りはPerl5のコードを意味します。

source: This form is illegal in a Perl 6 file.
ja: この形式は、Perl6のファイルとしては違法です。

source: If you wish to have a file-scoped package, either use the brace form or declare it with the module keyword instead.
ja: ファイルスコープのパッケージを作りたいなら、括弧形式を使うか、(packageの)代わりにmoduleキーワードを使って宣言します。

source: Since there are no barewords in Perl 6, package names must be predeclared, or use the sigil-like ::PackageName syntax to indicate that the type will be supplied some other way.
ja: Perl6 では裸のワードは存在しないので、パッケージ名はあらかじめ宣言されていなければならず、そうでなければ型が他の場所で提供されている可能性を示すのにシジルみたいな::PackageName構文を使います。

source: The :: prefix does not imply globalness as it does in Perl 5.
ja: ::の接頭辞は、perl5でのようにグローバル性を示す訳ではありません。

source: (Use GLOBAL:: for that.)
ja: (それを示すためにはGLOBAL::を使いましょう。)

source: A bare package declarator (without an explicit scope declarator such as my) declares an our package within the current package (or module, or class, or role, or...).
ja: 裸のpackage宣言(myのようなスコープ宣言子を付けないような)は、現在のパッケージ(やモジュール、クラス、ロールなど)の中のourパッケージを宣言します。

source: Use GLOBAL:: to declare a global package name.
ja: グローバルなパッケージ名を宣言するには、GLOBAL::を使いましょう。

source: To declare a lexically scoped package, use my package.
ja: レキシカルスコープなパッケージを宣言するには、my packageを使いましょう。

source: To declare an anonymous package you can use either of
ja: 匿名のパッケージを宣言するには、
